#ifndef __TIMER_H
#define __TIMER_H

#include "sys.h"

/****************************************************************************************
 宏定义区
****************************************************************************************/
#define PWM_DEV_1	0
#define PWM_DEV_2	1
#define PWM_DEV_3	2
#define PWM_DEV_4	3

/****************************************************************************************
 结构体定义区
****************************************************************************************/
typedef struct __TIMER_INFO
{
	TIM_TypeDef*	timer;
	u32				irq;
	u32				apb;
	u32				arr;
	u32				psc;

	u32				keep;
}TIMER_INFO;

/****************************************************************************************
 函数声明区
****************************************************************************************/
extern void timer_init(u16 dev);
extern void timer_reinit(u16 dev,u32 arr, u32 psc,u32 keep);
extern void set_fan_keep_time(unsigned short tim );
 
#endif
